# Part Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReloadSwapOutInfo..::..Part Property
ReloadSwapOutInfo Class See Also
---
The ElementId of part being swapped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ElementId Part { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Part As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ Part {
	ElementId^ get ();
}
```

# See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace